- 作者：东哥起飞
- 公众号：Python数据科学

## 第一章：变量类型及转换

In [5]:
import pandas as pd
import numpy as np

### 2、查询变量类型select_dtypes

In [21]:
df = pd.DataFrame({'a': [1, 2] * 3,
                   'b': [True, False] * 3,
                   'c': [1.0, 2.0] * 3,
                   'd': ['a','b']*3})

In [22]:
num_list = df.select_dtypes(include=['float','int64']).columns.tolist()
obj_list = df.select_dtypes(include=['object']).columns.tolist()

In [27]:
display(obj_list)

['d']

In [25]:
num_list

['a', 'c']

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       6 non-null      int64
 1   b       6 non-null      bool
 2   c       6 non-null      float64
 3   d       6 non-null      object
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 278.0+ bytes

### 3、转转数值类型

In [48]:
s = pd.Series(['boy', '1.0', '2019-01-02', 1, False, None, pd.Timestamp('2018-01-05')])

In [53]:
d = pd.to_numeric(s,errors='coerce',downcast='signed')

In [54]:
pd.DataFrame([s,d]).T

                     0    1
0                  boy  NaN
1                  1.0    1
2           2019-01-02  NaN
3                    1    1
4                False    0
5                  NaN  NaN
6  2018-01-05 00:00:00  NaT

### 4、转换字符类型

In [71]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [77]:
df['month'] = df['month'].map(str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    2 non-null      int64
 1   month   2 non-null      object
 2   day     2 non-null      int64
dtypes: int64(2), object(1)
memory usage: 176.0+ bytes

In [78]:
a = '[1,2,3]'
type(a)

str

In [79]:
eval(a)

[1, 2, 3]

### 5、转换时间类型

In [62]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [10]:
pd.to_datetime(df)

0   2015-02-04
1   2016-03-05
dtype: datetime64[ns]

In [63]:
df1 = pd.DataFrame({'appl_tm':['20220401','20220402','20220403'],'appl_tm1':['2012.03.04','2021.09.04','2031.06.05']})
df1

    appl_tm    appl_tm1
0  20220401  2012.03.04
1  20220402  2021.09.04
2  20220403  2031.06.05

In [65]:
df1['appl_tm'] = pd.to_datetime(df1['appl_tm'])
df1

     appl_tm    appl_tm1
0 2022-04-01  2012.03.04
1 2022-04-02  2021.09.04
2 2022-04-03  2031.06.05

In [66]:
df1['appl_tm1'] = pd.to_datetime(df1['appl_tm1'], format='%Y.%m.%d')
df1

     appl_tm   appl_tm1
0 2022-04-01 2012-03-04
1 2022-04-02 2021-09-04
2 2022-04-03 2031-06-05

In [70]:
df1[df1['appl_tm1'].dt.year == 2021]

     appl_tm   appl_tm1
1 2022-04-02 2021-09-04

### 6、转换category类型

In [58]:
df = pd.DataFrame({'year': [2015, 2016],
                   'month': [2, 3],
                   'day': [4, 5]})
df

   year  month  day
0  2015      2    4
1  2016      3    5

In [59]:
df['year'] = df['year'].astype('category')

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    2 non-null      category
 1   month   2 non-null      int64
 2   day     2 non-null      int64
dtypes: category(1), int64(2)
memory usage: 258.0 bytes

### 7、智能类型转换convert_dtypes

In [6]:
df = pd.DataFrame(
    {
        "a": pd.Series([1, 2, 3], dtype=np.dtype("int32")),
        "b": pd.Series(["x", "y", "z"], dtype=np.dtype("O")),
        "c": pd.Series([True, False, np.nan], dtype=np.dtype("O")),
        "d": pd.Series(["h", "i", np.nan], dtype=np.dtype("O")),
        "e": pd.Series([10, np.nan, 20], dtype=np.dtype("float")),
        "f": pd.Series([np.nan, 100.5, 200], dtype=np.dtype("float")),
    })

In [7]:
df

   a  b      c    d     e      f
0  1  x   True    h  10.0    NaN
1  2  y  False    i   NaN  100.5
2  3  z    NaN  NaN  20.0  200.0

In [8]:
df.dtypes

a      int32
b     object
c     object
d     object
e    float64
f    float64
dtype: object

In [13]:
# 对整个dataframe直接转换
dfn = df.convert_dtypes()

In [14]:
dfn

   a  b      c     d     e      f
0  1  x   True     h    10    NaN
1  2  y  False     i  <NA>  100.5
2  3  z   <NA>  <NA>    20  200.0

In [15]:
dfn.dtypes

a      Int32
b     string
c    boolean
d     string
e      Int64
f    float64
dtype: object

In [16]:
# Series 变量类型转换
s = pd.Series(["a", "b", np.nan])

In [17]:
s

0      a
1      b
2    NaN
dtype: object

In [18]:
s.convert_dtypes()

0       a
1       b
2    <NA>
dtype: string